# Напишите программу, которая выводит прямоугольник, по периметру
# состоящий из звездочек (*).
# Примечание. Высота и ширина прямоугольника равны
# 4 и 17 звёздочкам соответственно.

# print('*****************')
# print('*               *')
# print('*               *')
# print('*****************')


# Напишите программу, которая считывает два целых числа a и b и выводит
# на экран квадрат суммы (a+b)^2 и сумму квадратов a^2+b^2 этих чисел.

# num1 = int(input())
# num2 = int(input())

# print('Квадрат суммы', num1, 'и', num2, 'равен', (num1+num2)**2)
# print('Сумма квадратов', num1, 'и', num2, 'равна', num1**2 + num2**2)


# Как известно, целые числа в языке Python не имеют ограничений, которые
# встречаются в других языках программирования. Напишите программу,
# которая считывает четыре целых положительных числа a, b, c и d и
# выводит на экран значение выражения a^b + c^d.

# a = int(input())
# b = int(input())
# c = int(input())
# d = int(input())

# print(a**b+c**d)


# Напишите программу, которая считывает целое положительное число n,
# n∈[1;9] и выводит значение числа n+{nn}+{nnn}.
# Примечание. Для первого теста 1 + 11 + 111 = 123.

# num = int(input())

# print(num + (num*10 + num) + (num*100 + num*10 + num))
