# Напишите программу, которая выводит на экран
# текст «I***like***Python» (без кавычек).

# print('I', 'like', 'Python', sep='***')


# Напишите программу, которая считывает строку-разделитель
# и три строки, а затем выводит указанные строки через разделитель.

# separator = input()
# name1 = input()
# name2 = input()
# name3 = input()
# print(name1, name2, name3, sep = separator)


# Напишите программу, которая приветствует пользователя,
# выводя слово «Привет» (без кавычек), после которого должна стоять
# запятая и пробел, а затем введенное имя и восклицательный знак.

# name = input()
# print('Привет', name, sep=', ', end='!')
