# Тема урока: ввод-вывод данных

# Вывод данных, команда print

#  Напишите программу, которая выводит данную последовательность чисел 
# с одним пробелом между ними: 4 8 15 16 23 42

# print('4', '8', '15', '16', '23', '42')


# Измените предыдущую программу так, чтобы каждое число последовательности 
# 4 8 15 16 23 42 печаталось на отдельной строке.

# print('4')
# print('8')
# print('15')
# print('16')
# print('23')
# print('42')


# Напишите программу, которая выводит указанный треугольник:
# *
# **
# ***
# ****
# *****
# ******
# *******

# print('*')
# print('**')
# print('***')
# print('****')
# print('*****')
# print('******')
# print('*******')